import BreadCrumb from "../../../../components/BreadCrumb";
import Image from "next/image";
import { FaRegEye, FaRegCommentDots } from "react-icons/fa";
import { IoCalendarNumberOutline } from "react-icons/io5";
import BlogRelatedSlider from "../../../../components/slider/BlogRelatedSlider";
const SingleBlog = () => {
    return (
        <>
            <div className="">
                <BreadCrumb secondTitle="بلاگ" secondLink="/blog" title="اولین مقاله من" />
            </div>
            <section className="flex flex-col gap-5 justify-start">
                <Image
                    src="/images/singleblog.jpg"
                    width={1100}
                    height={600}
                    alt="اولین مقاله من"
                    quality={100}
                    className="rounded-md"
                />
                <h2>اولین مقاله من</h2>
                <div className="flex gap-3 text-base sm:text-sm border-b border-orange-400 pb-4">
                    <div className="bg-gray-200 py-1 flex gap-2 items-center justify-center rounded-md w-32">
                        <FaRegEye color="orange" size={20} />
                        <p>بازدید:</p>
                        <span>500</span>
                    </div>
                    <div className="bg-gray-200 py-1 flex gap-2 items-center justify-center rounded-md w-32">
                        <FaRegCommentDots color="orange" size={20} />
                        <p>دیدگاه:</p>
                        <span>500</span>
                    </div>
                    <div className="bg-gray-200 py-1 flex gap-2 items-center justify-center rounded-md w-32">
                        <IoCalendarNumberOutline color="orange" size={20} />
                        <span>1403/07/02</span>
                    </div>
                </div>
                <div>
                    <p className="text-justify leading-10">لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.</p>
                </div>
                <div>
                    <BlogRelatedSlider title="مقالات مرتبط"/>
                </div>
                <div className="h-96 w-full rounded-md p-4 border">
                    <h2 className='mb-5 border-r-2 pr-3 border-gray-200'>دیدگاه ها</h2>
                    
                </div>
            </section>
        </>

    );
}

export default SingleBlog;